In [43]:
import numpy
import pandas as pd
import numpy as np
csv = "./data/train.csv"
dataframe = pd.read_csv(csv)

# 판다스 2
## 정렬하기

In [44]:
# 정렬하기
dataframe.sort_values(by='Age', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

## 고유한 값 찾기

In [45]:
# 고유한 값 찾기
dataframe['Sex'].unique()
# 카운트를 출력합니다.
dataframe['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [46]:
# 고유한 값의 개수를 출력합니다.
dataframe['Pclass'].nunique()

3

In [47]:
# 전체 칼럼의 값의 개수를 출력합니다.
dataframe.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

## 누락된 값 다루기

In [48]:
dataframe[dataframe['Age'].isnull()].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S

NaN을 tkdydgkfuaus numpy 라이브러리의 numpy.nan 사용

In [49]:
# NaN으로 값을 바꾸려고 합니다.
dataframe['Sex'] = dataframe['Sex'].replace('male',numpy.NaN)
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",NaN,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [50]:
# 데이터를 적재하고 누랃된 값을 설정합니다.
dataframe = pd.read_csv(csv, na_values=[np.nan, 'NONE', -999])
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [51]:
dataframe = pd.read_csv(csv, na_values=['female'], keep_default_na=False)
dataframe[12:14]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.050,,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39,1,5,347082,31.275,,S

## 열 삭제하기

In [52]:
# 열을 삭제합니다.
dataframe.drop('Age', axis=1).head(2)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,1,0,PC 17599,71.2833,C85,C

In [53]:
# 여러 열을 삭제합니다.
dataframe.drop(['Age','Sex'], axis=1).head(2)

,PassengerId,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,PC 17599,71.2833,C85,C

In [54]:
# 열인덱스 지정하여 PClass 열을 삭제합니다.
dataframe.drop(dataframe.columns[1], axis=1).head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38,1,0,PC 17599,71.2833,C85,C

## 행삭제

In [55]:
# 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe[dataframe['Sex'] != 'male'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",NaN,26,0,0,STON/O2. 3101282,7.9250,,S

In [56]:
# 중복 행을 삭제하고 처음 두개의 행을 출력합니다.
dataframe.drop_duplicates().head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38,1,0,PC 17599,71.2833,C85,C

In [57]:
# 행의 갯수를 출력합니다.
print("원본 데이터프레임 행의 갯수:",len(dataframe))
print("중복 제거 후 행의 갯수:",len(dataframe.drop_duplicates()))

원본 데이터프레임 행의 갯수: 891
중복 제거 후 행의 갯수: 891

In [58]:
# 중복된 행을 삭제합니다. 처음 나타난 것 유지
dataframe.drop_duplicates(subset=['Sex'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38,1,0,PC 17599,71.2833,C85,C

In [59]:
# 중복된 행을 삭제합니다. 마지막에 나타난 것 유지
dataframe.drop_duplicates(subset=['Sex'], keep='last')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,,1,2,W./C. 6607,23.45,,S
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,,Q

## 값에 따라 그룹핑

In [60]:
#sex 열릐 값으로 행을 그룹핑하고 평균을 계산합니다.
dataframe.groupby('Sex').mean()

      PassengerId  Survived    Pclass     SibSp     Parch       Fare
Sex
male   454.147314  0.188908  2.389948  0.429809  0.235702  25.523893

In [61]:
# 행을 그룹핑합니다.
dataframe.groupby('Sex')

In [62]:
# 행을 그룹핑하고 카운트를 출력합니다.
dataframe.groupby('Survived')['Name'].count()

Survived
0    549
1    342
Name: Name, dtype: int64

In [68]:
# 'Age' 열을 숫자 형식으로 변환하고, 숫자가 아닌 값은 NaN으로 설정합니다.
dataframe['Age'] = pd.to_numeric(dataframe['Age'], errors='coerce')
# 'Age' 열에 NaN 값이 있는 행을 제거합니다.
dataframe.dropna(subset=['Age'], inplace=True)

In [69]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex   Survived
male  0           31.618056
      1           27.276022
Name: Age, dtype: float64

## 열 반복하기

In [70]:
# 처음 두 이름을 대문자로 바꾸어 출력합니다.
for name in dataframe['Name'][0:2]:
    print(name.upper())

BRAUND, MR. OWEN HARRIS
CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)

In [71]:
# 처음 두 이름을 대문자로 바꾸어 출력합니다. 2
[name.upper() for name in dataframe['Name'][0:2]]

['BRAUND, MR. OWEN HARRIS',
 'CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)']

## 모든 열 원소에 함수 적용

In [72]:
# 함수를 만듭니다.
def uppercase(x):
    return x.upper()

# 함수를 적용하고 두 개의 행을 출력합니다.
dataframe['Name'].apply(uppercase)[0:2]

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

In [73]:
#Servived 열의 1을 Live로, 0을 Dead로 바꾸어 출력합니다.
dataframe['Survived'].map({1:'Live',0:'Dead'})[:5]

0    Dead
1    Live
2    Live
3    Live
4    Dead
Name: Survived, dtype: object

In [75]:
# 함수의 매개 변수(age)를 apply 메서드를 호출할 때 전달할 수 있습니다.
dataframe['Age'].apply(lambda x, age: x < age, age=30)[:5]

0     True
1    False
2     True
3    False
4    False
Name: Age, dtype: bool

In [77]:
# 각 열에서 가장 큰 값을 뽑습니다.
# 숫자로 변환할 수 있는 값만을 남기고 나머지는 NaN으로 설정
df = dataframe.apply(pd.to_numeric, errors='coerce')
df.apply(lambda x: max(x))

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Name                NaN
Sex                 NaN
Age             80.0000
SibSp            5.0000
Parch            6.0000
Ticket              NaN
Fare           512.3292
Cabin               NaN
Embarked            NaN
dtype: float64

In [80]:
#applymap 메서드는 map 매서드와 비슷하게 열의 각 원소에 적용
def truncate_string(x):
    if type(x) == str:
        return x[:20]
    return x
# 문자열의 길이를 최대 20자로 줄입니다.
dataframe.applymap(truncate_string)[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Har",male,22.0,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John B",NaN,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Lai",NaN,26.0,0,0,STON/O2. 3101282,7.9250,,S
3,4,1,1,"Futrelle, Mrs. Jacqu",NaN,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William H",male,35.0,0,0,373450,8.0500,,S

## 그룹에 함수 적용

In [81]:
# 행을 그룹핑한 다음 함수를 적용합니다.
dataframe.groupby('Sex').apply(lambda x: x.count())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
male,453,453,453,453,453,453,453,453,453,453,453,453

## 데이터 프레임 연결

In [82]:
# 행방향으로 데티어 프레임을 연결합니다.
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2'],
                    'C': ['C0', 'C1', 'C2']},
                   index=[0, 1, 2])
df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
                    'B': ['B3', 'B4', 'B5'],
                    'C': ['C3', 'C4', 'C5']},
                     index=[3, 4, 5])
pd.concat([df1, df2], axis=0)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [83]:
# 열방향으로 데이터 프레임을 연결합니다.
pd.concat([df1, df2], axis=1)

     A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   A3   B3   C3
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5

## 데이터 프레임 병합

In [84]:
# 데이터프레임을 생성
employee_data = {'employee_id': ['1', '2', '3', '4'],
                 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
                          'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
                                                             'name'])
# 데이터프레임을 생성
sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
                                                       'total_sales'])
# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

외부 조인(outer join) 은 how 매개변수로 지정

In [85]:
# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [86]:
# 왼쪽 조인
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [87]:
# 오른쪽 조인
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455

In [88]:
# 각 데이터 프레임에서 병합하기 위한 열 이름 지정 가능
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

pandas는 numpy와 같이 데이터를 다루는데 유용한 기능을 많이 제공합니다.
다음과 같이 random 한 숫자로 Dataframe을 생성이 가능하며,

In [90]:
# random 한 3행 4열의 DataFrame을 생성합니다.
data_frame = pd.DataFrame(np.random.rand(3,4))
data_frame

          0         1         2         3
0  0.071981  0.340708  0.957743  0.404697
1  0.042904  0.972910  0.801551  0.071919
2  0.858565  0.419731  0.175053  0.134239

numpy 에서 제공하는 함수를 바로 적용 할 수도 있다.

In [91]:
# data_frame의 각 원소에 log를 적용합니다.

In [92]:
new_data_frame = np.log(data_frame)
new_data_frame

          0         1         2         3
0 -2.631352 -1.076728 -0.043176 -0.904615
1 -3.148791 -0.027463 -0.221206 -2.632216
2 -0.152493 -0.868142 -1.742668 -2.008133

또한 ndarray로 간편한 변환도 재공한다.

In [94]:
# DataFrame을 ndarray로 변환합니다.
nparray = np.array(data_frame)
nparray

array([[0.07198105, 0.3407085 , 0.95774283, 0.40469747],
       [0.04290396, 0.9729104 , 0.80155145, 0.07191893],
       [0.85856489, 0.41973051, 0.17505266, 0.13423903]])

## Treatment with NaN
 Pandas는 NaN(누락값)에 대해 적절한 처리를 제공한다.
 다음과 같이 NaN이 존재하는 모든 행을 삭제할 수 있다.

In [95]:
data_frame.dropna()

          0         1         2         3
0  0.071981  0.340708  0.957743  0.404697
1  0.042904  0.972910  0.801551  0.071919
2  0.858565  0.419731  0.175053  0.134239

 혹은 아래와 같이 NaN이 존재하는 모든 열을 삭제할 수도 있다.

In [96]:
data_frame.dropna(axis=1)

          0         1         2         3
0  0.071981  0.340708  0.957743  0.404697
1  0.042904  0.972910  0.801551  0.071919
2  0.858565  0.419731  0.175053  0.134239

 특정 행이나 열에서 NaN을 제거하고 싶다면 아래와 같이 처리 가능하다.

In [102]:
dataframe_2 = pd.DataFrame({'col1':[1,2,np.NaN,4,5],
                            'col2':[1,2,np.NaN,4,5],
                            'col3':['A','B',np.nan,'C','D'],
                            'col4':[1,np.NaN,3,4,5],
                            'col5':[1,2,3,np.NaN,5]})
#col1, col2 열에 NaN이 포함된 행을 삭제
dataframe_2.dropna(subset=['col1','col2'])
#3행과 5행에 NaN이 포함된 열을 삭제
dataframe_2.dropna(axis=1, subset=[3, 4])

   col1  col2 col3  col4
0   1.0   1.0    A   1.0
1   2.0   2.0    B   NaN
2   NaN   NaN  NaN   3.0
3   4.0   4.0    C   4.0
4   5.0   5.0    D   5.0

 혹은 NaN을 다른 값으로 모두 대체하거나

In [103]:
#모든 NaN을 0으로 치환한다
dataframe_2.fillna(0)

   col1  col2 col3  col4  col5
0   1.0   1.0    A   1.0   1.0
1   2.0   2.0    B   0.0   2.0
2   0.0   0.0    0   3.0   3.0
3   4.0   4.0    C   4.0   0.0
4   5.0   5.0    D   5.0   5.0

 특정 열의 NaN을 다른 값으로 대체할 수도 있다.

In [104]:
dataframe_2.isnull()

    col1   col2   col3   col4   col5
0  False  False  False  False  False
1  False  False  False   True  False
2   True   True   True  False  False
3  False  False  False  False   True
4  False  False  False  False  False

특정 조건을 만족할 때 대체하도록 설정할 수 있다.

In [107]:
#NaN을 같은 열의 바로 위의 행 값으로 대체
dataframe_2.fillna(method='ffill')
#NaN을 같은 열의 바로 아래 행 값으로 대체
dataframe_2.fillna(method='bfill')

   col1  col2 col3  col4  col5
0   1.0   1.0    A   1.0   1.0
1   2.0   2.0    B   3.0   2.0
2   4.0   4.0    C   3.0   3.0
3   4.0   4.0    C   4.0   5.0
4   5.0   5.0    D   5.0   5.0